In [1]:
import pandas as pd

In [13]:
data = [(1, 2, 3, 4),
        (5, 6, 7, 8),
        (8, 10, 11, 12),
        (13, 14, 15, 16)]
df = pd.DataFrame(data, 'l1 l2 l3 l4'.split(), 'c1 c2 c3 c4'.split())

In [14]:
df

    c1  c2  c3  c4
l1   1   2   3   4
l2   5   6   7   8
l3   8  10  11  12
l4  13  14  15  16

In [4]:
# criando uma serie com uma coluna em especifico
df["c1"]

l1     1
l2     5
l3     8
l4    13
Name: c1, dtype: int64

In [5]:
# criando um novo data frame apenas com algumas colunas
df[["c3","c1"]]

    c3  c1
l1   3   1
l2   7   5
l3  11   8
l4  15  13

In [6]:
df[:]

    c1  c2  c3  c4
l1   1   2   3   4
l2   5   6   7   8
l3   8  10  11  12
l4  13  14  15  16

In [7]:
df[1:]

    c1  c2  c3  c4
l2   5   6   7   8
l3   8  10  11  12
l4  13  14  15  16

In [9]:
# 1 entra e o 3 nao - para linhas
df[1:3]

    c1  c2  c3  c4
l2   5   6   7   8
l3   8  10  11  12

In [11]:
# a partir do 1 seleciona apenas as colunas c1 e c3
df[1:][["c3","c1"]]

    c3  c1
l2   7   5
l3  11   8
l4  15  13

In [12]:
# cria uma series com a linha do DF
df.loc["l3"]

c1     8
c2    10
c3    11
c4    12
Name: l3, dtype: int64

In [14]:
df.loc[["l3","l2"]]

    c1  c2  c3  c4
l3   8  10  11  12
l2   5   6   7   8

In [16]:
# loc pode ser usado para pegar um valor em especifico tambem
df.loc["l1", "c2"]

2

In [18]:
# iloc usa o indice numerico
df.iloc[0,1]

2

In [8]:
# pode selecionar linha e coluna 
df.loc[["l1","l2"],["c2","c3"]]

    c2  c3
l1   2   3
l2   6   7

In [9]:
#fazendo a msm coisa porem com indice
df.iloc[[0,1],[1,2]]

    c2  c3
l1   2   3
l2   6   7

## Testes

In [15]:
alunos_data = [("Leo","M",24,True),
               ("Alice","F",40, True),
               ("Cicero","M",40, False),
               ("Arthur","M",2,False),
               ("Laura","F",7,False)]

alunos = pd.DataFrame(alunos_data, columns=["Nome", "Sexo", "Idade","Aprovado"])
alunos

     Nome Sexo  Idade  Aprovado
0     Leo    M     24      True
1   Alice    F     40      True
2  Cicero    M     40     False
3  Arthur    M      2     False
4   Laura    F      7     False

In [24]:
selecao = alunos["Aprovado"] == False

alunos[["Nome","Sexo","Idade"]][selecao]

     Nome Sexo  Idade
2  Cicero    M     40
3  Arthur    M      2
4   Laura    F      7

In [34]:
mais_novos = alunos.sort_values(by="Idade")
mais_novos.iloc[:3]

     Nome Sexo  Idade  Aprovado
3  Arthur    M      2     False
4   Laura    F      7     False
0     Leo    M     24      True